app/Http/Controllers/Pago/PagoController.php

select * from "postulante" where "idusuario" = '4' limit 1
---
    public function index($id = null)
    {
        $existe = Postulante::where('idusuario',Auth::user()->id)->count();

select * from "servicio" where "codigo" = '475' limit 1
---
    public function pdf($servicio,$id = null)
    {
        if (isset($id)) {
           $postulante = Postulante::find($id);
        } else {
           $postulante = Postulante::Usuario()->first();
        }

        if(isset($postulante)){
        $servicio = Servicio::where('codigo',$servicio)->first();