app/Http/Controllers/Recursos/UbigeoController.php

select * from "pais" where "pais"."id" = '1' limit 1
---
    public function pais(Request $request)
    {
        $idpais = $request->varsearch ?:'1';

        return Pais::find($idpais);