app/Http/ViewComposers/EspecialidadSelectData.php

	public function compose(View $view)
	{
		$especialidad = Especialidad::Activo()->orderBy('nombre')->pluck('nombre','id')->toarray();
---
select "nombre", "id" from "especialidad" where "activo" = '1' order by "nombre" asc