app/Http/ViewComposers/ModalidadSelectData.php

	public function compose(View $view)
	{
		$modalidad = Modalidad::Activo()->orderBy('id')->pluck('nombre','id')->toarray();
		$segunda_modalidad_cepre = Modalidad::where('modalidad2','ID-CEPRE')->Activo()->orderBy('id')->pluck('nombre','id')->toarray();
---
select "nombre", "id" from "modalidad" where "activo" = '1' order by "id" asc
select "nombre", "id" from "modalidad" where "modalidad2" = 'ID-CEPRE' and "activo" = '1' order by "id" asc