app/Http/Controllers/Ficha/FichaController.php

    public function index($id = null)
    {
        $postulante = Postulante::Usuario()->first();
        if (isset($postulante)) {
            $correcto_foto = false;
            $correcto_datos_p = false;
            $correcto_datos_f = false;
            $correcto_datos_e = false;
            $correcto_pagos = false;
            $msj = collect([]);

            #Valida Foto Editada

            if(isset($postulante) && $postulante->foto_estado == 'ACEPTADO'){
                $correcto_foto = true;
            }elseif (isset($postulante) && $postulante->foto_estado == 'SIN FOTO') {
                $correcto_foto = false;
                $msj->push(['titulo'=>'Error de Foto','mensaje'=>'Usted no ha cargado su foto']);
            }elseif (isset($postulante) && $postulante->foto_estado == 'RECHAZADO') {
                $correcto_foto = false;
                $msj->push(['titulo'=>'Error de Foto','mensaje'=>'La foto que usted ha cargado en el sistema ha sido rechazada, vuelva a cargar una foto mas nitida con fondo blanco sin lentes, si tiene problemas puede enviar su foto al correo informes@admisionuni.edu.pe']);
            }elseif(isset($postulante) && $postulante->foto_estado == 'CARGADO') {
                $correcto_foto = false;
                $msj->push(['titulo'=>'Edicion de Foto','mensaje'=>'En estos momentos estamos editando su foto']);
            }

            #Valida datos adicionales----------------------------------------
            $proceso = Proceso::where('idpostulante',$postulante->id)->first();
---
select * from "proceso" where "idpostulante" = '1' limit 1

            #Valida Pagos-------------------------------------------------------
            $pagos = new PagoController();
            $pagos = $pagos->CalculoServicios();
            $recaudacion = Recaudacion::select('servicio','monto')->where('idpostulante',$postulante->id)->get();
---
select "servicio", "monto" from "recaudacion" where "idpostulante" = '1'

     public function pdf($id = null)
    {
        if (isset($id)) {
    	   $postulante = Postulante::find($id);
        } else {
           $postulante = Postulante::Usuario()->first();
        }

        $evaluacion = Evaluacion::Activo()->first();
---
select * from "evaluacion" where "activo" = '1' limit 1