app/Http/Controllers/Datos/DatosModalidadController.php

select * from "modalidad" where "modalidad"."id" = '1' limit 1
---
    public function infomodalidad(Request $request)
    {
        $idmodalidad = $request->idmodalidad ?:'';
        if($request->idmodalidad > 0)$modalidad = Modalidad::findOrfail($idmodalidad);