app/Http/Controllers/Datos/DatosPersonalesController.php

select * from "postulante" where "idusuario" = '4' limit 1
---
    public function index()
    {
        $dni = Auth::user()->dni;
        $id = Auth::user()->id;
        $postulante = Postulante::where('idusuario',$id)->first();