app/Http/Controllers/Datos/DatosController.php

    public function index()
    {
    	$dni = Auth::user()->dni;
    	$id = Auth::user()->id;
    	$postulante = Postulante::where('idusuario',$id)->first();
---
select * from "postulante" where "idusuario" = '4' limit 1