app/Helpers/App.php

    function ColegioPersonal($id)
    {
        if (isset($id)) {
            $colegio = Colegio::where('id',$id)->pluck('nombre','id')->toarray();
---
select "nombre", "id" from "colegio" where "id" = '427'

    function UniversidadPersonal($id)
    {
        if (isset($id)) {
            $universidad = Universidad::where('id',$id)->pluck('nombre','id')->toarray();
---
select "nombre", "id" from "universidad" where "id" = '427'