app/Models/Catalogo.php

select "iditem" from "catalogo" where "idtable" = '0' and "nombre" = 'ROLES' limit 1
---
	public function Maestro($NameTable){
		$data=$this->select('iditem')
				   ->where('idtable',0)
			       ->where('nombre',"$NameTable")->first();

select "id" from "catalogo" where "idtable" = '5' and "codigo" = 'DNI' and "activo" = '1'
---
	public function scopeIdCatalogoCodigo($cadenaSQL,$NameTable,$codigo){
		$idtable=$this->Maestro($NameTable);
		return $cadenaSQL->where('idtable',$idtable)
						 ->where('codigo',$codigo)
						 ->where('activo',1)->pluck('id')[0];