app/Models/Cronograma.php

    public function scopeFechaInicio($cadenaSQL,$codigo){
    	return $cadenaSQL->select('fecha_inicio')->where('codigo',$codigo)->first()->fecha_inicio;
---
select "fecha_inicio" from "cronograma" where "codigo" = 'INCE' limit 1

    public function scopeFechaFin($cadenaSQL,$codigo){
    	return $cadenaSQL->select('fecha_fin')->where('codigo',$codigo)->first()->fecha_fin;
---
select "fecha_fin" from "cronograma" where "codigo" = 'INCE' limit 1