app/Models/Postulante.php

    public function getIdentificacionAttribute()
    {
        $tipo = Catalogo::find($this->idtipoidentificacion);
---
select * from "catalogo" where "catalogo"."id" = '28' limit 1

    public function getGestionIeAttribute()
    {
        $modalidad = Modalidad::find($this->idmodalidad);
        if ($modalidad->colegio) $ie = Colegio::find($this->idcolegio);
---
select * from "modalidad" where "modalidad"."id" = '1' limit 1
select * from "colegio" where "colegio"."id" = '427' limit 1

    public function getCodigoModalidadAttribute()
    {
        $modalidad = Modalidad::find($this->idmodalidad);
---
select * from "modalidad" where "modalidad"."id" = '1' limit 1

    public function getNombreModalidadAttribute()
    {
        $modalidad = Modalidad::find($this->idmodalidad);
---
select * from "modalidad" where "modalidad"."id" = '1' limit 1

    public function getNombreEspecialidadAttribute()
    {
        $especialidad = Especialidad::find($this->idespecialidad);
---
select * from "especialidad" where "especialidad"."id" = '9' limit 1

    public function getCodigoEspecialidadAttribute()
    {
        $especialidad = Especialidad::find($this->idespecialidad);
---
select * from "especialidad" where "especialidad"."id" = '9' limit 1

    public function getCodigoEspecialidad2Attribute()
    {
        $especialidad = Especialidad::find($this->idespecialidad2);
---
select * from "especialidad" where "especialidad"."id" is null limit 1

    public function getDescripcionUbigeoAttribute()
    {
        $pais = Pais::find($this->idpais);
        $ubigeo = Ubigeo::find($this->idubigeo);
---
select * from "pais" where "pais"."id" = '1' limit 1
select * from "ubigeo" where "ubigeo"."id" = '1455' limit 1

    public function getDescripcionUbigeoNacimientoAttribute()
    {
        $pais = Pais::find($this->idpaisnacimiento);
        $ubigeo = Ubigeo::find($this->idubigeonacimiento);
---
select * from "pais" where "pais"."id" = '29' limit 1
select * from "ubigeo" where "ubigeo"."id" is null limit 1